{
    "abstract": "Synthetic datasets constructed from formal languages allow fine-grained examination of the learning and generalization capabilities of machine learning systems for sequence classification. This article presents a new benchmark for machine learning systems on sequence classification called MLRegTest, which contains training, development, and test sets from 1,800 regular languages. Different kinds of formal languages represent different kinds of long-distance dependencies, and correctly identifying long-distance dependencies in sequences is a known challenge for ML systems to generalize successfully.  MLRegTest organizes its languages according to their logical complexity (monadic second order, first order, propositional, or restricted propositional) and the kind of logical literals (string, tier-string, subsequence, or combinations thereof). The logical complexity and choice of literal provides a systematic way to understand different kinds of long-distance dependencies in regular languages, and therefore to understand the capacities of different ML systems to learn such long-distance dependencies. Finally, the performance of different neural networks (simple RNN, LSTM, GRU, transformer) on MLRegTest is examined. The main conclusion is that performance depends significantly on the kind of test set, the class of language, and the neural network architecture.",
    "authors": [
        "Sam van der Poel",
        "Dakotah Lambert",
        "Kalina Kostyszyn",
        "Tiantian Gao",
        "Rahul Verma",
        "Derek Andersen",
        "Joanne Chau",
        "Emily Peterson",
        "Cody St. Clair",
        "Paul Fodor",
        "Chihiro Shibata",
        "Jeffrey Heinz"
    ],
    "emails": [
        "samvanderpoel@gatech.edu",
        "dakotahlambert@acm.org",
        "kalina.kostyszyn@stonybrook.edu",
        "tiagao@cs.stonybrook.edu",
        "rxverma1@gmail.com",
        "derek.andersen@alumni.stonybrook.edu",
        "choryan.chau@alumni.stonybrook.edu",
        "emily.peterson@alumni.stonybrook.edu",
        "cody.stclair@alumni.stonybrook.edu",
        "pfodor@cs.stonybrook.edu",
        "chihiro@hosei.ac.jp",
        "jeffrey.heinz@stonybrook.edu"
    ],
    "extra_links": [
        [
            "code",
            "https://doi.org/10.5061/dryad.dncjsxm4h"
        ]
    ],
    "id": "23-0518",
    "issue": 283,
    "pages": [
        1,
        45
    ],
    "title": "MLRegTest: A Benchmark for the Machine Learning of Regular Languages",
    "volume": 25,
    "year": 2024
}