{
    "abstract": "aeon is a unified Python 3 library for all machine learning tasks involving time series. The package contains modules for time series forecasting, classification, extrinsic regression and clustering, as well as a variety of utilities, transformations and distance measures designed for time series data. aeon also has a number of experimental modules for tasks such as anomaly detection, similarity search and segmentation. aeon follows the scikit-learn API as much as possible to help new users and enable easy integration of aeon estimators with useful tools such as model selection and pipelines. It provides a broad library of time series algorithms, including efficient implementations of the very latest advances in research. Using a system of optional dependencies, aeon integrates a wide variety of packages into a single interface while keeping the core framework with minimal dependencies. The package is distributed under the 3-Clause BSD license and is available at https://github.com/aeon-toolkit/aeon.",
    "authors": [
        "Matthew Middlehurst",
        "Ali Ismail-Fawaz",
        "Antoine Guillaume",
        "Christopher Holder",
        "David Guijo-Rubio",
        "Guzal Bulatova",
        "Leonidas Tsaprounis",
        "Lukasz Mentel",
        "Martin Walter",
        "Patrick Sch{{\\\"a}}fer",
        "Anthony Bagnall"
    ],
    "emails": [
        "m.b.middlehurst@soton.ac.uk",
        "ali-el-hadi.ismail-fawaz@uha.fr",
        "antoine.guillaume@novahe.fr",
        "c.holder@uea.ac.uk",
        "dguijo@uco.es",
        "guzalbulatova@gmail.com",
        "leonidas.tsap@gmail.com",
        "lukasz.mentel@pm.me",
        "martin.friedrich.walter@gmail.com",
        "patrick.schaefer@hu-berlin.de",
        "a.j.bagnall@soton.ac.uk"
    ],
    "extra_links": [
        [
            "code",
            "https://github.com/aeon-toolkit/aeon"
        ]
    ],
    "id": "23-1444",
    "issue": 289,
    "pages": [
        1,
        10
    ],
    "special_issue": "MLOSS",
    "title": "aeon: a Python Toolkit for Learning from Time Series",
    "volume": 25,
    "year": 2024
}