{
    "abstract": "Unsupervised domain adaptation (UDA) adapts a model from a labeled source domain to an unlabeled target domain in a one-off way. Though widely applied, UDA faces a great challenge whenever the distribution shift between the source and the target is large. Gradual domain adaptation (GDA) mitigates this limitation by using intermediate domains to gradually adapt from the source to the target domain. In this work, we first theoretically analyze gradual self-training, a popular GDA algorithm, and provide a significantly improved generalization bound compared with Kumar et al. (2020). Our theoretical analysis leads to an interesting insight: to minimize the generalization error on the target domain, the sequence of intermediate domains should be placed uniformly along the Wasserstein geodesic between the source and target domains. The insight is particularly useful under the situation where intermediate domains are missing or scarce, which is often the case in real-world applications. Based on the insight, we propose Generative Gradual Domain Adaptation with Optimal Transport (GOAT), an algorithmic framework that can generate intermediate domains in a data-dependent way. More concretely, we first generate intermediate domains along the Wasserstein geodesic between two given consecutive domains in a feature space, then apply gradual self-training to adapt the source-trained classifier to the target along the sequence of intermediate domains. Empirically, we demonstrate that our GOAT framework can improve the performance of standard GDA when the given intermediate domains are scarce, significantly broadening the real-world application scenarios of GDA. Our code is available at https://github.com/uiuctml/GOAT.",
    "authors": [
        "Yifei He",
        "Haoxiang Wang",
        "Bo Li",
        "Han Zhao"
    ],
    "emails": [
        "yifeihe3@illinois.edu",
        "hwang264@illinois.edu",
        "bol@uchicago.edu",
        "hanzhao@illinois.edu"
    ],
    "extra_links": [
        [
            "code",
            "https://github.com/uiuctml/GOAT"
        ]
    ],
    "id": "23-1180",
    "issue": 361,
    "pages": [
        1,
        40
    ],
    "title": "Gradual Domain Adaptation: Theory and Algorithms",
    "volume": 25,
    "year": 2024
}