{
    "abstract": "Climate simulations are essential in guiding our understanding of climate change and responding to its effects. However, it is computationally expensive to resolve complex climate processes at high spatial resolution. As one way to speed up climate simulations, neural networks have been used to downscale climate variables from fast-running low-resolution simulations, but high-resolution training data are often unobtainable or scarce, greatly limiting accuracy. In this work, we propose a downscaling method based on the Fourier neural operator. It is trained using a low upsampling factor and then can zero-shot (without additional training) downscale its input to arbitrary unseen high resolution. Evaluated both on ERA5 climate model data and on the Navier-Stokes equation solution data, our downscaling model significantly outperforms state-of-the-art convolutional and generative adversarial downscaling models, both in standard single-resolution downscaling and in zero-shot generalization to higher upsampling factors. Furthermore, we show that our method also outperforms state-of-the-art data-driven partial differential equation solvers on Navier-Stokes equations. Overall, our work bridges the gap between simulation of a physical process and interpolation of low-resolution output, showing that it is possible to combine both approaches and significantly improve upon each other.",
    "authors": [
        "Qidong Yang",
        "Alex Hernandez-Garcia",
        "Paula Harder",
        "Venkatesh Ramesh",
        "Prasanna Sattigeri",
        "Daniela Szwarcman",
        "Campbell D. Watson",
        "David Rolnick"
    ],
    "emails": [
        "qy707@nyu.edu",
        "alex.hernandez-garcia@mila.quebec",
        "paula.harder@mila.quebec",
        "venkatesh.ramesh@mila.quebec",
        "psattig@us.ibm.com",
        "daniela.szw@ibm.com",
        "cwatson@us.ibm.com",
        "drolnick@mila.quebec"
    ],
    "extra_links": [
        [
            "code",
            "https://github.com/qy707/DSFNO"
        ]
    ],
    "id": "23-0597",
    "issue": 420,
    "pages": [
        1,
        30
    ],
    "title": "Fourier Neural Operators for Arbitrary Resolution Climate Data Downscaling",
    "volume": 25,
    "year": 2024
}