{
    "abstract": "Statistical analysis is increasingly confronted with complex data from metric spaces.  Petersen and Müller (2019) established a general paradigm of Fréchet regression with complex metric space valued responses and Euclidean predictors. However, the local approach therein involves nonparametric kernel smoothing and suffers from the curse of dimensionality. To address this issue, we in this paper propose a novel random forest weighted local Fréchet regression paradigm. The main mechanism of our approach relies on a locally adaptive kernel generated by random forests. Our first method uses these weights as the local average to solve the conditional Fréchet mean, while the second method performs local linear Fréchet regression, both significantly improving existing Fréchet regression methods. Based on the theory of infinite order U-processes and infinite order $M_{m_n}$-estimator, we establish the consistency, rate of convergence, and asymptotic normality for our local constant estimator, which covers the current large sample theory of random forests with Euclidean responses as a special case. Numerical studies show the superiority of our methods with several commonly encountered types of responses such as distribution functions, symmetric positive-definite matrices, and sphere data. The practical merits of our proposals are also demonstrated through the application to New York taxi data and human mortality data.",
    "authors": [
        "Rui Qiu",
        "Zhou Yu",
        "Ruoqing Zhu"
    ],
    "emails": [
        "rqiu_stat@outlook.com",
        "zyu@stat.ecnu.edu.cn",
        "rqzhu@illinois.edu"
    ],
    "extra_links": [
        [
            "code",
            "https://github.com/RuiQiu01/Code_RFWLFR.git"
        ]
    ],
    "id": "23-0811",
    "issue": 107,
    "pages": [
        1,
        69
    ],
    "title": "Random Forest Weighted Local Fr{{\\'e}}chet Regression with Random Objects",
    "volume": 25,
    "year": 2024
}